RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_selftest_v2.c
/*******************************************************************************
* Function Name: Cy_CapSense_SetPinDr
****************************************************************************//**
*
* The internal function that sets a certain pin output data register (DR).
*
* The function sets a pin output data register (DR) in a desired state.
*
* \param *ioPtr
* A pointer to the specified pin in the widget pin configuration structure.
*
* \param value
* A port output data which will be set for the pin.
*
*******************************************************************************/
static void Cy_CapSense_SetPinDr(
                cy_stc_capsense_pin_config_t const *ioPtr,
                uint32_t value)
{
    uint32_t  interruptState;

    /* Set a data register */
    interruptState = Cy_SysLib_EnterCriticalSection();
    Cy_GPIO_Write(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber, value);
    Cy_SysLib_ExitCriticalSection(interruptState);
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetPinPc
****************************************************************************//**
*
* The internal function that sets a certain pin output drive mode (PC).
*
* The function sets a pin port control register (PC) in a desired state.
*
* \param *ioPtr
* A pointer to the specified pin in the widget pin configuration structure.
*
* \param value
* Drive mode to be set for the pin.
*
*******************************************************************************/
static void Cy_CapSense_SetPinPc(
                cy_stc_capsense_pin_config_t const *ioPtr,
                uint32_t value)
{
    uint32_t  interruptState;

    /* Update the port configuration register (Drive mode) */
    interruptState = Cy_SysLib_EnterCriticalSection();
    Cy_GPIO_SetDrivemode(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber, value);
    Cy_SysLib_ExitCriticalSection(interruptState);
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_SHORT_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_MeasureCapacitanceSensor
****************************************************************************//**
*
* Measures the specified CSD sensor / CSX electrode capacitance in femtofarads.
*
* This function measures the capacitance of the sensor (electrode for CSX
* widgets) and returns the measurement status. For a CSX sensor, the
* measurement is done on either Rx or Tx electrode.
* For a CSD sensor, measurement is done on a sensor (refer to the
* sensorId parameter description).
* If the specified sensor (electrode) is a ganged sensor, the capacitance
* is measured for all the pins ganged together that belong to this sensor
* (electrode).
*
* The measured capacitance is stored in the .eltdCap[] array.
* The .ptrEltdCapacitance field of the
* \ref cy_stc_capsense_widget_config_t structure contains a pointer to
* the first widget sensor (electrode) element within the .eltdCap[] array.
*
* In addition to the measuring sensor (electrode) capacitance, this function
* is used to identify various fault conditions with sensors such
* as electrically-opened or -shorted sensors. For example, the PCB track is
* broken or shorted to other nodes in the system - in all of these conditions,
* this function returns changed capacitance which can be compared
* against predetermined capacitance for the sensor to detect a
* fault condition.
*
* The sensor capacitance is measured independently of the sensor scan
* configuration. For the capacitance measurement, the CSD sensing method is used.
* The measurements consists of up to four scans with different IDAC current.
* The IDAC current of the first measurement is 6 uA and each next measurement
* the IDAC current increase by four times. The default scanning parameters
* are the following:
* * I (6 uA) is the current equal to IDAC Gain * IDAC Code
*   (Compensation IDAC is disabled).
* * Res (12 bits) is the scanning resolution.
* * Vref (1.2 V) is the reference voltage.
* * SnsClk (375 kHz) is the sensor clock frequency.
*
* If the scanning raw count is within 7.5% to 45% range of a maximum raw count
* the raw count is converted into capacitance using the following equation:
*
*  Cs = Rawcount * I / ((2^Res - 1) * Vref * SnsClk)
*
* where:
* * Cs is the sensor capacitance.
* * Rawcount is the measured raw count value.
*
* If the raw count is less than 7.5% of the maximum limit (2^Res - 1), the
* function stops scanning the sequence and returns the
* CY_CAPSENSE_BIST_LOW_LIMIT_E status.
*
* If the raw count is between 7.5% and 45% of the maximum, the function
* calculates the sensor capacitance, updates the register map and
* returns CY_CAPSENSE_BIST_SUCCESS_E status.
*
* If the raw count is above 45% of the maximum, the function repeats
* scanning with a 4x increased IDAC current (up to four scans in total).
*
* The minimum measurable input by this function is 1pF and the
* maximum is either 384pF or limited by the RC time constant
* (Cs < 1 / (2*5*SnsClk*R), where R is the total sensor series
* resistance that includes on-chip GPIO resistance ~500 Ohm and
* external series resistance). The measurement accuracy is about 15%.
*
* By default, all CAPSENSE&trade; sensors (electrodes) that are not being
* measured are set to the GND state for CSD measured electrodes (sensors) and
* to the HIGH-Z state for CSX measured electrodes (Rx and Tx).
* Shield electrodes are also configured to the GND state.
* The inactive state can be changed in run-time by using
* the Cy_CapSense_SetInactiveElectrodeState() function.
*
* By default, the Cmod capacitor is used for the measurement. If a dedicated
* Cmod is not available (e.g. the design has CSX widgets only), CintA and CintB
* capacitors are combined together by the firmware to form a single integration
* capacitor for the measurement.
*
* The sensor measurement can be done on all the sensors using
* the Cy_CapSense_RunSelfTest() function along with
* the CY_CAPSENSE_BIST_SNS_CAP_MASK mask.
*
* This function must not be called while the CSD HW block is busy by another
* state.
*
* \note
* This function is available only for the fourth-generation CAPSENSE&trade;.
*
* \param widgetId
* Specifies the ID number of the widget.
* A macro for the widget ID can be found in the
* CAPSENSE&trade; Configuration header file (cycfg_capsense.h) defined as
* CY_CAPSENSE_<WidgetName>_WDGT_ID.
*
* \param sensorId
* Specifies the ID of the sensor (electrode for CSX widgets) within the widget
* to be measured.
*
* For the CSD widgets, a macro for the sensor ID within the specified widget
* can be found in the CAPSENSE&trade; Configuration header file (cycfg_capsense.h)
* defined as CY_CAPSENSE_<WidgetName>_SNS<SensorNumber>_ID.
*
* For the CSX widgets, sensorId is an electrode ID and is defined as Rx ID
* or Tx ID. The first Rx in a widget corresponds to electrodeId = 0, the
* second Rx in a widget corresponds to electrodeId = 1, and so on.
* The last Tx in a widget corresponds to electrodeId = (RxNum + TxNum - 1).
* Macros for Rx and Tx IDs can be found in the CAPSENSE&trade; Configuration header
* file (cycfg_capsense.h) defined as:
* * CapSense_<WidgetName>_RX<RXNumber>_ID
* * CapSense_<WidgetName>_TX<TXNumber>_ID.
*
* \param ptrValue
* The pointer to the measured capacitance in femtofarads.
* The user declares a variable of the uint32_t type and passes the variable
* pointer as the function parameter. If the ptrValue parameter is NULL,
* the capacitance value is not returned through the parameter but still stored
* in the corresponding field of the data structure.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E          - The measurement completes
*                                         successfully, the result is valid.
* - CY_CAPSENSE_BIST_BAD_PARAM_E        - The input parameter is invalid.
*                                         The measurement was not executed.
* - CY_CAPSENSE_BIST_HW_BUSY_E          - The CSD HW block is busy with a
*                                         previous operation.
*                                         The measurement was not executed.
* - CY_CAPSENSE_BIST_LOW_LIMIT_E        - The measurement was executed and
*                                         the scanning result is below
*                                         the minimum possible value.
*                                         The measurement result could be invalid.
*                                         The sensor might be shorted to VDD
*                                         or a sensor PCB track
*                                         was broken (open sensor).
* - CY_CAPSENSE_BIST_HIGH_LIMIT_E       - The measurement was executed and
*                                         the scanning result is above the
*                                         maximum possible value.
*                                         The measurement result could be invalid.
*                                         The sensor might be shorted to GND.
* - CY_CAPSENSE_BIST_ERROR_E            - An unexpected fault occurred during
*                                         the measurement.
*
*******************************************************************************/
cy_en_capsense_bist_status_t Cy_CapSense_MeasureCapacitanceSensor(
                uint32_t widgetId,
                uint32_t sensorId,
                uint32_t * ptrValue,
                cy_stc_capsense_context_t * context)
{
    cy_en_capsense_bist_status_t result = CY_CAPSENSE_BIST_BAD_PARAM_E;
    cy_en_capsense_bist_io_state_t desiredIoState;
    uint32_t numWdgtElectrodes;
    cy_en_capsense_bist_hw_config_t hwConfiguration;
    uint32_t convNumber;

    if(NULL != context)
    {
        if ((context->ptrCommonConfig->numWd > widgetId))
        {
            /* Get a total number of the widget elements: for CSX, it is numRows + numCols, for CSD, it is totalNumSns */
            if (CY_CAPSENSE_CSX_GROUP == context->ptrWdConfig[widgetId].senseMethod)
            {
                /* For CSX widgets, get the index of the Rx electrode */
                numWdgtElectrodes = context->ptrWdConfig[widgetId].numRows +
                          (uint32_t)context->ptrWdConfig[widgetId].numCols;
            }
            else
            {
                numWdgtElectrodes = context->ptrWdConfig[widgetId].numSns;
            }
            if (numWdgtElectrodes > sensorId)
            {
                /* Release previously-captured HW resources by other mode and capture them for BIST */
                if (CY_CAPSENSE_SUCCESS_E == Cy_CapSense_SwitchSensingMode(CY_CAPSENSE_BIST_GROUP, context))
                {
                    /* Set the BUSY status */
                    context->ptrCommonContext->status = CY_CAPSENSE_BUSY;
                    /* Choose an inactive sensor connection (ISC) depending on the widget type */
                    switch (context->ptrWdConfig[widgetId].senseMethod)
                    {
                        case CY_CAPSENSE_CSD_GROUP:
                            desiredIoState = context->ptrBistContext->intrEltdCapCsdISC;
                            break;
                        case CY_CAPSENSE_CSX_GROUP:
                            desiredIoState = context->ptrBistContext->intrEltdCapCsxISC;
                            break;
                        default:
                            desiredIoState = CY_CAPSENSE_BIST_IO_UNDEFINED_E;
                            break;
                    }

                    hwConfiguration = CY_CAPSENSE_BIST_HW_ELTD_CAP_E;
                    if (CY_CAPSENSE_BIST_IO_SHIELD_E == desiredIoState)
                    {
                        hwConfiguration = CY_CAPSENSE_BIST_HW_ELTD_CAP_SH_E;
                    }
                    /* Switch the HW resource configuration to the sensor element capacitance measurement */
                    Cy_CapSense_BistSwitchHwConfig(hwConfiguration, context);
                    Cy_CapSense_BistSwitchAllSnsPinState(desiredIoState, context);

