RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_selftest_v2.c
    if((NULL != context) && (NULL != ptrScanConfig))
    {
        idacIdx = (uint32_t)ptrScanConfig->idacGainIndex;
        idacCode = (uint32_t)ptrScanConfig->idacMod;
        if (0u == ptrScanConfig->modClk)
        {
            ptrScanConfig->modClk = 1u;
        }
        snsClkFreqHz = context->ptrCommonConfig->periClkHz / ptrScanConfig->modClk / ptrScanConfig->snsClk;
        rawMaxNum = ((uint32_t)ptrScanConfig->convNum * (uint32_t)ptrScanConfig->snsClk) - 1u;

        if ((context->ptrCommonConfig->numWd > widgetId))
        {
            /* Get a total number of widget elements: for CSX, it is numRows + numCols, for CSD, it is totalNumSns */
            if (CY_CAPSENSE_CSX_GROUP == context->ptrWdConfig[widgetId].senseMethod)
            {
                /* For CSX widgets, get the index of the Rx electrode */
                numWdgtElectrodes = context->ptrWdConfig[widgetId].numRows +
                          (uint32_t)context->ptrWdConfig[widgetId].numCols;
                desiredIoState = context->ptrBistContext->intrEltdCapCsxISC;
            }
            else
            {
                numWdgtElectrodes = context->ptrWdConfig[widgetId].numSns;
                desiredIoState = context->ptrBistContext->intrEltdCapCsdISC;
            }
            if (numWdgtElectrodes > sensorId)
            {
                /* Release previously-captured HW resources by the other mode and capture them for BIST */
                if (CY_CAPSENSE_SUCCESS_E == Cy_CapSense_SwitchSensingMode(CY_CAPSENSE_BIST_GROUP, context))
                {
                    /* Set the BUSY status */
                    context->ptrCommonContext->status = CY_CAPSENSE_BUSY;
                    hwConfiguration = CY_CAPSENSE_BIST_HW_ELTD_CAP_E;
                    if (CY_CAPSENSE_BIST_IO_SHIELD_E == desiredIoState)
                    {
                        hwConfiguration = CY_CAPSENSE_BIST_HW_ELTD_CAP_SH_E;
                    }
                    /* Switch the HW resource configuration to sensor short test */
                    Cy_CapSense_BistSwitchHwConfig(hwConfiguration, context);
                    Cy_CapSense_BistSwitchAllSnsPinState(desiredIoState, context);
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                        Cy_CapSense_BistSwitchAllShieldPinState(CY_CAPSENSE_BIST_IO_STRONG_E, context);
                    #endif
                    /* Calculate the VrefHigh voltage */
                    vRefMv = Cy_CapSense_GetVrefHighMv((uint32_t)ptrScanConfig->vrefGain, context);

                    /* RefGen initialization */
                    temp = CSD_REFGEN_REFGEN_EN_Msk | CSD_REFGEN_RES_EN_Msk |
                            ((uint32_t)ptrScanConfig->vrefGain << CSD_REFGEN_GAIN_Pos);
                    #if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
                        if (CY_CAPSENSE_LOW_VOLTAGE_LIMIT > context->ptrCommonConfig->vdda)
                        {
                            temp = CSD_REFGEN_REFGEN_EN_Msk | CSD_REFGEN_BYPASS_Msk;
                        }
                    #endif
                    context->ptrCommonConfig->ptrCsdBase->REFGEN = temp;

                    /* Connect the specified sensor (CSX electrode) */
                    Cy_CapSense_BistConnectElectrode(widgetId, sensorId, context);
                    /* Set the divider value for the mod clock (1u lower than the desired divider) */
                    Cy_CapSense_SetClkDivider(((uint32_t)ptrScanConfig->modClk - 1u), context);
                    /* Set the divider value for the sense clock (1u lower than the desired divider) */
                    context->ptrCommonConfig->ptrCsdBase->SENSE_PERIOD = ((uint32_t)ptrScanConfig->snsClk - 1u);
                    /* Set Number Of Conversions for the custom scan */
                    context->ptrCommonConfig->ptrCsdBase->SEQ_NORM_CNT = (uint32_t)ptrScanConfig->convNum;
                    /* Setup the IDAC code and Gain */
                    context->ptrCommonConfig->ptrCsdBase->IDACA =
                            (context->ptrCommonConfig->ptrCsdBase->IDACA & ~CY_CAPSENSE_BIST_IDAC_BITS_TO_WRITE) |
                            ((context->ptrCommonConfig->idacGainTable[idacIdx].gainReg | idacCode |
                            CSD_IDACA_LEG1_MODE_Msk | CSD_IDACA_LEG2_MODE_Msk) & CY_CAPSENSE_BIST_IDAC_BITS_TO_WRITE);

                    /* Perform scanning */
                    result = Cy_CapSense_BistMeasureCapacitanceSensorRun(context);
                    if (CY_CAPSENSE_BIST_TIMEOUT_E != result)
                    {
                        modClkDivider = ptrScanConfig->modClk;
                        snsClkDivider = ptrScanConfig->snsClk;

                        if(0u == snsClkDivider)
                        {
                            snsClkDivider = 1u;
                        }

                        isBusyWatchdogTimeUs  = (uint64_t)ptrScanConfig->convNum;
                        isBusyWatchdogTimeUs *= (uint64_t)snsClkDivider * modClkDivider * CY_CAPSENSE_CONVERSION_MEGA;
                        isBusyWatchdogTimeUs /= context->ptrCommonConfig->periClkHz;

                        if(0u == isBusyWatchdogTimeUs)
                        {
                            isBusyWatchdogTimeUs = 1u;
                        }

                        isBusyWatchdogTimeUs *= CY_CAPSENSE_BIST_WATCHDOG_MARGIN_COEFF;

                        cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA;
                        watchdogPeriod = Cy_CapSense_WatchdogCyclesNum((uint32_t)isBusyWatchdogTimeUs, cpuFreqMHz,
                                                                       CY_CAPSENSE_BIST_CAP_MEAS_WDT_CYCLES_PER_LOOP);

                        /* Wait for the end of the scan and get the raw counts */
                        if (0u == Cy_CapSense_BistWaitEndOfScan(watchdogPeriod, context))
                        {
                            result = CY_CAPSENSE_BIST_TIMEOUT_E;
                        }
                        else
                        {
                            rawCountTmp = (context->ptrCommonConfig->ptrCsdBase->RESULT_VAL1 &
                                          CY_CAPSENSE_CSD_RESULT_VAL1_VALUE_MSK);
                            /* Capacitance calculation and storage */
                            if(NULL != ptrValue)
                            {
                                cp = ((uint64_t)context->ptrCommonConfig->idacGainTable[idacIdx].gainValue) * (uint64_t)idacCode;
                                cp *= (uint64_t)rawCountTmp;
                                cp *= CY_CAPSENSE_CONVERSION_MEGA;
                                cp /= (uint64_t)rawMaxNum;
                                cp /= (uint64_t)snsClkFreqHz;
                                cp /= (uint64_t)vRefMv;
                                if (((uint64_t)CY_CAPSENSE_BIST_CP_MAX_VALUE) < cp)
                                {
                                    cp = (uint64_t)CY_CAPSENSE_BIST_CP_MAX_VALUE;
                                }
                                *ptrValue = (uint32_t)cp;
                            }
                            result = CY_CAPSENSE_BIST_SUCCESS_E;
                        }
                    }
                    /* Clear all interrupt pending requests */
                    context->ptrCommonConfig->ptrCsdBase->INTR = CY_CAPSENSE_CSD_INTR_ALL_MSK;
                    (void)context->ptrCommonConfig->ptrCsdBase->INTR;
                    /* Disconnect the sensor */
                    Cy_CapSense_BistDisconnectElectrode(widgetId, sensorId, context);
                    /* Clear the BUSY flag */
                    context->ptrCommonContext->status = CY_CAPSENSE_NOT_BUSY;
                }
                else
                {
                    result = CY_CAPSENSE_BIST_HW_BUSY_E;
                }
            }
        }
    }

    return (result);
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) */


