RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_selftest_v2.c
#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN) ||\
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceSensorInit
****************************************************************************//**
*
* This internal function calculates the parameters for sensor or shield
* capacitance measurements and register values before speeding up
* the execution.
*
* It is called by Cy_CapSense_BistDsInitialize() once at the CAPSENSE&trade; MW start.
*
* The following parameters of cy_stc_capsense_bist_context_t are used as
* an input for the calculation:
* * .eltdCapModClk
* * .eltdCapSnsClk
* * .eltdCapVrefMv
* * .eltdCapResolution
*
* The function checks for parameter limitations and corrects the values before
* the calculation if they exceed.
*
* The following parameters of cy_stc_capsense_bist_context_t are updated
* by the calculation:
* * .eltdCapModClk
* * .eltdCapSnsClk
* * .eltdCapSnsClkFreqHz
* * .eltdCapVrefGain
* * .eltdCapVrefMv
* * .eltdCapResolution
*
* Restarting CAPSENSE&trade; MW or calling of the Cy_CapSense_BistDsInitialize()
* function overwrites the output parameters.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_BistMeasureCapacitanceSensorInit(
                cy_stc_capsense_context_t * context)
{
    uint32_t temp;
    cy_stc_capsense_bist_context_t * ptrBistCxt = context->ptrBistContext;

    /* ModClk */
    if (0u == ptrBistCxt->eltdCapModClk)
    {
        ptrBistCxt->eltdCapModClk = 1u;
    }
    if (CY_CAPSENSE_BIST_ELTD_CAP_MAX_MODCLK < (context->ptrCommonConfig->periClkHz / ptrBistCxt->eltdCapModClk))
    {
        ptrBistCxt->eltdCapModClk <<= 1u;
    }

    /* SnsClk */
    if (0u == ptrBistCxt->eltdCapSnsClk)
    {
        /*
         * Calculate the snsClc divider with rounding to achieve a frequency closer to
         * CY_CAPSENSE_BIST_ELTD_CAP_SNSCLK_DEFAULT snsClk
         */
        ptrBistCxt->eltdCapSnsClk = (uint16_t)(((context->ptrCommonConfig->periClkHz / ptrBistCxt->eltdCapModClk) +
                (CY_CAPSENSE_BIST_ELTD_CAP_SNSCLK_DEFAULT >> 1uL)) / CY_CAPSENSE_BIST_ELTD_CAP_SNSCLK_DEFAULT);
    }
    /* Check the snsClk divider value */
    if (CY_CAPSENSE_BIST_SNS_CLK_MIN_DIVIDER > ptrBistCxt->eltdCapSnsClk)
    {
        ptrBistCxt->eltdCapSnsClk = CY_CAPSENSE_BIST_SNS_CLK_MIN_DIVIDER;
    }
    if (CY_CAPSENSE_BIST_SNS_CLK_MAX_DIVIDER < ptrBistCxt->eltdCapSnsClk)
    {
        ptrBistCxt->eltdCapSnsClk = CY_CAPSENSE_BIST_SNS_CLK_MAX_DIVIDER;
    }
    ptrBistCxt->eltdCapSnsClkFreqHz = context->ptrCommonConfig->periClkHz / ptrBistCxt->eltdCapModClk / ptrBistCxt->eltdCapSnsClk;

    /* Reference Voltage */
    if(ptrBistCxt->eltdCapVrefMv == 0u)
    {
        /* Get the recommended reference voltage */
        temp = CY_CAPSENSE_BIST_CAP_MEAS_VREF_MV_DEFAULT;
    }
    else
    {
        /* Use the user-defined reference voltage */
        temp = (uint32_t)ptrBistCxt->eltdCapVrefMv;
    }
    ptrBistCxt->eltdCapVrefGain = (uint8_t)Cy_CapSense_GetVrefHighGain(temp, context);
    ptrBistCxt->eltdCapVrefMv = (uint16_t)Cy_CapSense_GetVrefHighMv((uint32_t)ptrBistCxt->eltdCapVrefGain, context);

    /* Resolution */
    if (CY_CAPSENSE_BIST_ELTD_CAP_MAX_RESOLUTION < ptrBistCxt->eltdCapResolution)
    {
        ptrBistCxt->eltdCapResolution = CY_CAPSENSE_BIST_ELTD_CAP_MAX_RESOLUTION;
    }
    if (CY_CAPSENSE_BIST_ELTD_CAP_MIN_RESOLUTION > ptrBistCxt->eltdCapResolution)
    {
        ptrBistCxt->eltdCapResolution = CY_CAPSENSE_BIST_ELTD_CAP_MIN_RESOLUTION;
    }

    /* HW block register pre-calculation */
    /* BYP switch selection */
    ptrBistCxt->regSwBypSel = CY_CAPSENSE_CSD_SW_BYP_SEL_SW_BYA_MSK;
    ptrBistCxt->regSwBypSelShield = CY_CAPSENSE_CSD_SW_BYP_SEL_SW_BYA_MSK;
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
        ptrBistCxt->regSwBypSel = CY_CAPSENSE_CSD_SW_BYP_SEL_SW_BYA_MSK | CY_CAPSENSE_CSD_SW_BYP_SEL_SW_BYB_MSK;
        ptrBistCxt->regSwBypSelShield = CY_CAPSENSE_CSD_SW_BYP_SEL_SW_BYA_MSK | CY_CAPSENSE_CSD_SW_BYP_SEL_SW_BYB_MSK;
    #endif

    ptrBistCxt->regAmbuf = 0u;
    ptrBistCxt->regSwResInit = ((uint32_t)context->ptrCommonConfig->csdInitSwRes << CSD_SW_RES_RES_HCAV_Pos) |
                               ((uint32_t)context->ptrCommonConfig->csdInitSwRes << CSD_SW_RES_RES_HCBV_Pos);
    ptrBistCxt->regSwResScan = ((uint32_t)context->ptrCommonConfig->csdShieldSwRes << CSD_SW_RES_RES_HCBV_Pos) |
                               ((uint32_t)context->ptrCommonConfig->csdShieldSwRes << CSD_SW_RES_RES_HCBG_Pos);
    ptrBistCxt->regIoSel = (CY_CAPSENSE_CSD_TX_N_OUT_EN_PHI1 | CY_CAPSENSE_CSD_TX_N_AMUXA_EN_PHI2);
    ptrBistCxt->regSwDsiSel = CY_CAPSENSE_BIST_SW_DSI_SEL_DEFAULT;
    ptrBistCxt->regSwRefgenSel = CY_CAPSENSE_CSD_SW_REFGEN_SEL_SW_SGR_MSK;

    #if (CY_CAPSENSE_PSOC6_FOURTH_GEN)
        if (CY_CAPSENSE_VREF_PASS == context->ptrCommonConfig->ssVrefSource)
        {
            ptrBistCxt->regSwRefgenSel = CY_CAPSENSE_CSD_SW_REFGEN_SEL_SW_SGRP_MSK;
        }
    #endif

    #if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
        #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
            switch (context->ptrInternalContext->csdCmodConnection)
            {
                case (uint8_t)CY_CAPSENSE_CMODPAD_E:
                    ptrBistCxt->regSwDsiSel |= CY_CAPSENSE_CSD_SW_DSI_SEL_CMOD_MSK;
                    break;
                case (uint8_t)CY_CAPSENSE_CTANKPAD_E:
                    ptrBistCxt->regSwDsiSel |= CY_CAPSENSE_CSD_SW_DSI_SEL_CSH_TANK_MSK;
                    break;
                default:
                    /* No action on other connection types */
                    break;
            }

            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && \
                (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_CAP_EN))
                switch (context->ptrInternalContext->csdCshConnection)
                {
                    case (uint8_t)CY_CAPSENSE_CMODPAD_E:
                        ptrBistCxt->regSwDsiSel |= CY_CAPSENSE_CSD_SW_DSI_SEL_CMOD_MSK;
                        break;
                    case (uint8_t)CY_CAPSENSE_CTANKPAD_E:
                        ptrBistCxt->regSwDsiSel |= CY_CAPSENSE_CSD_SW_DSI_SEL_CSH_TANK_MSK;
                        break;
                    default:
                        /* No action on other connection types */
                        break;
                }
            #endif
        #else
            ptrBistCxt->regSwDsiSel = CY_CAPSENSE_CSD_SW_DSI_SEL_CMOD_MSK |
                    CY_CAPSENSE_CSD_SW_DSI_SEL_CSH_TANK_MSK;
        #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

    #endif

