RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_selftest_v2.c
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceSensorEnable
****************************************************************************//**
*
* The internal function sets up the CSD HW block to perform electrode
* (sensor or shield) capacitance measuring.
*
* This function prepares the CSD HW block to CSD sensing mode
* with BIST-defined parameters.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_BistMeasureCapacitanceSensorEnable(
                cy_stc_capsense_context_t * context)
{
    CSD_Type * ptrCsdHwBase = context->ptrCommonConfig->ptrCsdBase;

    /* Connect External Capacitor as CMOD to AMUXBUS-A and to CSDCOMP */
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCmod,
                (uint32_t)context->ptrCommonConfig->pinCmod, CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA);
        ptrCsdHwBase->SW_CMP_P_SEL = context->ptrInternalContext->csdRegSwCmpPSel;

        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && \
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_CAP_EN))
            Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCsh, (uint32_t)context->ptrCommonConfig->pinCsh,
                    CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXB);
        #endif
    #else /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */
        Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCintA,
                (uint32_t)context->ptrCommonConfig->pinCintA, CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA);
        Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCintB,
                (uint32_t)context->ptrCommonConfig->pinCintB, CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA);
        ptrCsdHwBase->SW_CMP_P_SEL = CY_CAPSENSE_CSD_SW_CMP_P_SEL_SW_SFPT_STATIC_CLOSE |
                                     CY_CAPSENSE_CSD_SW_CMP_P_SEL_SW_SFPM_STATIC_CLOSE;
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

    ptrCsdHwBase->CONFIG = context->ptrBistContext->regConfig;
    ptrCsdHwBase->REFGEN =
            CSD_REFGEN_REFGEN_EN_Msk |
            CSD_REFGEN_RES_EN_Msk    |
            ((uint32_t)context->ptrBistContext->eltdCapVrefGain << CSD_REFGEN_GAIN_Pos);
    #if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
        if (CY_CAPSENSE_LOW_VOLTAGE_LIMIT > context->ptrCommonConfig->vdda)
        {
            ptrCsdHwBase->REFGEN = CSD_REFGEN_REFGEN_EN_Msk | CSD_REFGEN_BYPASS_Msk;
        }
    #endif
    ptrCsdHwBase->INTR_MASK = CY_CAPSENSE_CSD_INTR_MASK_CLEAR_MSK;
    ptrCsdHwBase->AMBUF = context->ptrBistContext->regAmbuf;
    ptrCsdHwBase->ADC_CTL = 0u;
    ptrCsdHwBase->SEQ_TIME = 0u;
    ptrCsdHwBase->IDACA = 0u;
    ptrCsdHwBase->IDACB = 0u;
    ptrCsdHwBase->SENSE_DUTY = CY_CAPSENSE_CSD_SENSE_DUTY_CFG;
    ptrCsdHwBase->INTR_SET = 0u;
    ptrCsdHwBase->SEQ_INIT_CNT = (uint32_t)context->ptrBistContext->fineInitTime;
    ptrCsdHwBase->SW_REFGEN_SEL = context->ptrBistContext->regSwRefgenSel;
    ptrCsdHwBase->SW_HS_N_SEL = CY_CAPSENSE_CSD_SW_HS_N_SEL_SW_HCRH_STATIC_CLOSE;
    ptrCsdHwBase->SW_CMP_N_SEL = CY_CAPSENSE_CSD_SW_CMP_N_SEL_SW_SCRH_STATIC_CLOSE;
    ptrCsdHwBase->SW_HS_P_SEL = 0u;
    ptrCsdHwBase->SW_AMUXBUF_SEL = context->ptrBistContext->regSwAmuxbufSel;
    ptrCsdHwBase->SW_BYP_SEL = context->ptrBistContext->regSwBypSel;
    #if (CY_CAPSENSE_PSOC6_FOURTH_GEN)
        ptrCsdHwBase->IO_SEL = context->ptrBistContext->regIoSel;
    #endif
    ptrCsdHwBase->SW_DSI_SEL = context->ptrBistContext->regSwDsiSel;
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN) ||\
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN)) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN)
#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceSensorShieldEnable
****************************************************************************//**
*
* The internal function sets up the CSD HW block to perform electrode
* (sensor or shield) capacitance measuring with a configured shield.
*
* This function prepares HW of the CAPSENSE&trade; block to CSD sensing mode
* with BIST-defined parameters with inactive sensor connection (ISC) set
* to the shield.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_BistMeasureCapacitanceSensorShieldEnable(
                cy_stc_capsense_context_t * context)
{
    CSD_Type * ptrCsdHwBase = context->ptrCommonConfig->ptrCsdBase;

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCmod,
                (uint32_t)context->ptrCommonConfig->pinCmod, CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA);
        ptrCsdHwBase->SW_CMP_P_SEL = context->ptrInternalContext->csdRegSwCmpPSel;

        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && \
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_CAP_EN))
            Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCsh, (uint32_t)context->ptrCommonConfig->pinCsh,
                    CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXB);
        #endif
    #else /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */
        Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCintA,
                (uint32_t)context->ptrCommonConfig->pinCintA, CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA);
        Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCintB,
                (uint32_t)context->ptrCommonConfig->pinCintB, CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA);
        ptrCsdHwBase->SW_CMP_P_SEL = CY_CAPSENSE_CSD_SW_CMP_P_SEL_SW_SFPT_STATIC_CLOSE |
                                     CY_CAPSENSE_CSD_SW_CMP_P_SEL_SW_SFPM_STATIC_CLOSE;
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

    ptrCsdHwBase->CONFIG = context->ptrBistContext->regConfigShield;
    ptrCsdHwBase->REFGEN =
            CSD_REFGEN_REFGEN_EN_Msk |
            CSD_REFGEN_RES_EN_Msk    |
            ((uint32_t)context->ptrBistContext->eltdCapVrefGain << CSD_REFGEN_GAIN_Pos);
    #if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
        if (CY_CAPSENSE_LOW_VOLTAGE_LIMIT > context->ptrCommonConfig->vdda)
        {
            ptrCsdHwBase->REFGEN = CSD_REFGEN_REFGEN_EN_Msk | CSD_REFGEN_BYPASS_Msk;
        }
    #endif
    ptrCsdHwBase->INTR_MASK = CY_CAPSENSE_CSD_INTR_MASK_CLEAR_MSK;
    ptrCsdHwBase->AMBUF = context->ptrBistContext->regAmbufShield;
    ptrCsdHwBase->ADC_CTL = 0u;
    ptrCsdHwBase->SEQ_TIME = 0u;
    ptrCsdHwBase->IDACA = 0u;
    ptrCsdHwBase->IDACB = 0u;
    ptrCsdHwBase->SENSE_DUTY = CY_CAPSENSE_CSD_SENSE_DUTY_CFG;
    ptrCsdHwBase->INTR_SET = 0u;
    ptrCsdHwBase->SEQ_INIT_CNT = (uint32_t)context->ptrBistContext->fineInitTime;
    ptrCsdHwBase->SW_REFGEN_SEL = context->ptrBistContext->regSwRefgenSel;
    ptrCsdHwBase->SW_HS_N_SEL = CY_CAPSENSE_CSD_SW_HS_N_SEL_SW_HCRH_STATIC_CLOSE;
    ptrCsdHwBase->SW_CMP_N_SEL = CY_CAPSENSE_CSD_SW_CMP_N_SEL_SW_SCRH_STATIC_CLOSE;
    ptrCsdHwBase->SW_HS_P_SEL = context->ptrBistContext->regSwHsPSelScanShield;
    ptrCsdHwBase->SW_AMUXBUF_SEL = context->ptrBistContext->regSwAmuxbufSelShield;
    ptrCsdHwBase->SW_BYP_SEL = context->ptrBistContext->regSwBypSelShield;
    #if (CY_CAPSENSE_PSOC6_FOURTH_GEN)
        ptrCsdHwBase->IO_SEL = context->ptrBistContext->regIoSelShield;
    #endif
    ptrCsdHwBase->SW_DSI_SEL = context->ptrBistContext->regSwDsiSel;
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) */
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN) */


