RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_selftest_v2.c
#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN) ||\
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceSensor
****************************************************************************//**
*
* This internal function measures a capacitance attached to AMUXBUS.
*
* The function measures Cp of a certain electrode (CSD sensor or shield or CSX
* Rx/Tx electrode) by using CSD mode and defined IDAC configuration,
* sense clock frequency and resolution.
* The range for sensor measuring is 1 to 360 pF.
* The function performs up to 4 CSD scans with fixed IDAC values
* to reach a defined target of raw counts in the range from 7% to 45%
* of the maximum raw count value. This range provides a possibility of
* classical raw counts formula usage for capacitance calculation.
* The function stores the Cp value
* in the corresponding element of the eltdCap[CY_CAPSENSE_ELTD_COUNT] array.
*
* \param cpPtr
* The pointer to the uint32_t to store measured value of the capacitance.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E - The measurement completes
*                              successfully, the result is valid.
* - CY_CAPSENSE_BIST_BAD_PARAM_E - The input parameter is invalid.
* - CY_CAPSENSE_BIST_LOW_LIMIT_E - The measured capacitance is below
*                                the minimum possible value.
*                                The measurement result is invalid.
*                                The sensor might be shorted to VDD or a sensor
*                                PCB track was broken (open sensor).
* - CY_CAPSENSE_BIST_HIGH_LIMIT_E - The measured capacitance is above the
*                                 maximum possible value.
*                                 The measurement result is invalid.
*                                 The sensor might be shorted to GND.
* - CY_CAPSENSE_BIST_ERROR_E - An unexpected fault occurred during
*                            the measurement, the measurement may need
*                            to be repeated.
* - CY_CAPSENSE_BIST_TIMEOUT_E - The scan reached the timeout. It can be caused
*                              by a measured capacitance short or CSD HW block
*                              failure or invalid configuration. You may need to
*                              repeat the measurement after the issue fix.
*
*******************************************************************************/
static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureCapacitanceSensor(
                uint32_t * cpPtr,
                cy_stc_capsense_context_t * context)
{
    const uint32_t idacGainIdxTable[] = {2u, 2u, 4u, 5u};
    const uint32_t idacCodeTable[]= {20u, 80u, 40u, 80u};
    cy_en_capsense_bist_status_t result;
    uint32_t rawMaxNum = (0x01uL << context->ptrBistContext->eltdCapResolution) - 1u;
    uint32_t rawMinLimit = (rawMaxNum * CY_CAPSENSE_BIST_ELTD_CAP_MIN_RAW_PROMILLE) / CY_CAPSENSE_BIST_PROMILLE_FACTOR;
    uint32_t rawMaxLimit = (rawMaxNum * CY_CAPSENSE_BIST_ELTD_CAP_MAX_RAW_PROMILLE) / CY_CAPSENSE_BIST_PROMILLE_FACTOR;
    uint32_t counter = 0u;
    uint32_t idacCode;
    uint32_t idacIdx;
    uint32_t rawCountTmp = rawMaxNum;
    uint64_t cp;
    uint32_t modClkDivider;
    uint32_t cpuFreqMHz;
    uint32_t watchdogPeriod;
    uint64_t isBusyWatchdogTimeUs;


    /* Perform up to 4 scans to measure Cp */
    do
    {
        /* Setup scan parameters: IDAC and Gain */
        idacCode = idacCodeTable[counter];
        idacIdx = idacGainIdxTable[counter];
        context->ptrCommonConfig->ptrCsdBase->IDACA =
                (context->ptrCommonConfig->ptrCsdBase->IDACA & ~CY_CAPSENSE_BIST_IDAC_BITS_TO_WRITE) |
                ((context->ptrCommonConfig->idacGainTable[idacIdx].gainReg | idacCode |
                CSD_IDACA_LEG1_MODE_Msk | CSD_IDACA_LEG2_MODE_Msk) & CY_CAPSENSE_BIST_IDAC_BITS_TO_WRITE);

        /* Perform scanning */
        result = Cy_CapSense_BistMeasureCapacitanceSensorRun(context);
        if (CY_CAPSENSE_BIST_TIMEOUT_E != result)
        {

            modClkDivider = context->ptrBistContext->eltdCapModClk;
            if(0u == modClkDivider)
            {
                modClkDivider = 1u;
            }

            isBusyWatchdogTimeUs  = (uint64_t)((uint64_t)0x01 << context->ptrBistContext->eltdCapResolution);
            isBusyWatchdogTimeUs *= (uint64_t)modClkDivider * CY_CAPSENSE_CONVERSION_MEGA;
            isBusyWatchdogTimeUs /= context->ptrCommonConfig->periClkHz;

            if(0u == isBusyWatchdogTimeUs)
            {
                isBusyWatchdogTimeUs = 1u;
            }

            isBusyWatchdogTimeUs *= CY_CAPSENSE_BIST_WATCHDOG_MARGIN_COEFF;

            cpuFreqMHz = context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA;
            watchdogPeriod = Cy_CapSense_WatchdogCyclesNum((uint32_t)isBusyWatchdogTimeUs, cpuFreqMHz,
                                                           CY_CAPSENSE_BIST_CAP_MEAS_WDT_CYCLES_PER_LOOP);

            /* Wait for an end of the scan and get a raw count */
            if (0u != Cy_CapSense_BistWaitEndOfScan(watchdogPeriod, context))
            {
                rawCountTmp = context->ptrCommonConfig->ptrCsdBase->RESULT_VAL1 &
                                             CY_CAPSENSE_CSD_RESULT_VAL1_VALUE_MSK;
                /* Check for the measurement result status */
                if ((rawCountTmp < rawMinLimit) && (0u == counter))
                {
                    result = CY_CAPSENSE_BIST_LOW_LIMIT_E;
                }
                if ((rawCountTmp > rawMaxLimit) && (3u == counter))
                {
                    result = CY_CAPSENSE_BIST_HIGH_LIMIT_E;
                }
                if ((rawCountTmp >= rawMinLimit) && (rawCountTmp <= rawMaxLimit))
                {
                    result = CY_CAPSENSE_BIST_SUCCESS_E;
                }
            }
            else
            {
                result = CY_CAPSENSE_BIST_TIMEOUT_E;
            }
        }
        if (CY_CAPSENSE_BIST_TIMEOUT_E == result)
        {
            break;
        }
        counter++;
    }
    while ((CY_CAPSENSE_BIST_SUCCESS_E != result) && (CY_CAPSENSE_BIST_LOW_LIMIT_E != result) &&
           (CY_CAPSENSE_BIST_HIGH_LIMIT_E != result) && (counter < CY_CAPSENSE_BIST_ELTD_CAP_CYCLES_NUM));
    /* Clear all interrupt pending requests */
    context->ptrCommonConfig->ptrCsdBase->INTR = CY_CAPSENSE_CSD_INTR_ALL_MSK;
    (void)context->ptrCommonConfig->ptrCsdBase->INTR;

    if ((CY_CAPSENSE_BIST_TIMEOUT_E != result))
    {
        /* Capacitance calculation and storage to the data structure */
        cp = ((uint64_t)context->ptrCommonConfig->idacGainTable[idacIdx].gainValue) * (uint64_t)idacCode;
        cp *= (uint64_t)rawCountTmp;
        cp *= CY_CAPSENSE_CONVERSION_MEGA;
        cp /= (uint64_t)rawMaxNum;
        cp /= (uint64_t)context->ptrBistContext->eltdCapSnsClkFreqHz;
        cp /= (uint64_t)context->ptrBistContext->eltdCapVrefMv;
        if (((uint64_t)CY_CAPSENSE_BIST_CP_MAX_VALUE) < cp)
        {
            cp = (uint64_t)CY_CAPSENSE_BIST_CP_MAX_VALUE;
        }
        *cpPtr = (uint32_t)cp;
    }

    return (result);
}


