RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_selftest_v2.c
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceSensorRun
****************************************************************************//**
*
* This internal function performs coarse initialization for Cmod and Csh
* (or CintA and CintB for only CSX configurations) and triggers a scan
* for the sensor or shield electrode capacitance measurement.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the starting execution:
* - CY_CAPSENSE_BIST_HW_BUSY_E - The CSD HW block is successfully started
*                                and is busy with scanning.
* - CY_CAPSENSE_BIST_TIMEOUT_E - The pre-charge of the integration capacitor
*                                reached a timeout.
*
*******************************************************************************/
static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureCapacitanceSensorRun(
                cy_stc_capsense_context_t * context)
{
    cy_en_capsense_bist_status_t result = CY_CAPSENSE_BIST_SUCCESS_E;
    CSD_Type * ptrCsdHwBase = context->ptrCommonConfig->ptrCsdBase;
    uint32_t watchdogSize;
    uint32_t watchdogCounter;

    /* Approximate duration of Wait For Init loop */
    const uint32_t intrInitLoopDuration = 5uL;
    const uint32_t initWatchdogTimeUs = CY_CAPSENSE_BIST_PRECHARGE_WATCHDOG_TIME_US;

    watchdogSize = Cy_CapSense_WatchdogCyclesNum(initWatchdogTimeUs,
            context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA,
            intrInitLoopDuration);

    Cy_CapSense_DischargeExtCapacitors(context);

    /* External capacitor pre-charging */
    ptrCsdHwBase->CSDCMP = 0u;
    ptrCsdHwBase->HSCMP = CY_CAPSENSE_CSD_HSCMP_HSCMP_EN_MSK;
    ptrCsdHwBase->SW_RES = context->ptrBistContext->regSwResInit;
    ptrCsdHwBase->SW_FW_MOD_SEL = 0u;
    ptrCsdHwBase->SW_FW_TANK_SEL = 0u;

    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && \
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_CAP_EN))
        /* Clear previous interrupts */
        ptrCsdHwBase->INTR = CY_CAPSENSE_CSD_INTR_ALL_MSK;
        (void)ptrCsdHwBase->INTR;

        ptrCsdHwBase->SW_HS_P_SEL = context->ptrBistContext->regSwHsPSelCtankInit;
        ptrCsdHwBase->SW_SHIELD_SEL = CY_CAPSENSE_CSD_SW_SHIELD_SEL_SW_HCBV_HSCMP;

        /* Start SEQUENCER for coarse initialization for Ctank */
        ptrCsdHwBase->SEQ_START = CY_CAPSENSE_CSD_SEQ_START_SEQ_MODE_MSK |
                                  CY_CAPSENSE_CSD_SEQ_START_START_MSK    |
                                  CY_CAPSENSE_BIST_FSM_AZ0_SKIP          |
                                  CY_CAPSENSE_BIST_FSM_AZ1_SKIP;
    #endif

    /* Init Watchdog Counter to prevent a hang */
    watchdogCounter = Cy_CapSense_WaitForSeqIdle(watchdogSize, context);
    if (0u == watchdogCounter)
    {
        /* Set the sequencer to the idle state if the coarse initialization fails */
        ptrCsdHwBase->SEQ_START = CY_CAPSENSE_CSD_SEQ_START_ABORT_MSK;
        result = CY_CAPSENSE_BIST_TIMEOUT_E;
    }

    if (CY_CAPSENSE_BIST_SUCCESS_E == result)
    {
        /* Clear previous interrupts */
        context->ptrCommonConfig->ptrCsdBase->INTR = CY_CAPSENSE_CSD_INTR_ALL_MSK;
        (void)ptrCsdHwBase->INTR;

        ptrCsdHwBase->SW_HS_P_SEL = context->ptrBistContext->regSwHsPSelCmodInit;
        ptrCsdHwBase->SW_SHIELD_SEL = CY_CAPSENSE_CSD_SW_SHIELD_SEL_SW_HCAV_HSCMP;

        /* Start SEQUENCER for coarse initialization for Cmod */
        ptrCsdHwBase->SEQ_START = CY_CAPSENSE_CSD_SEQ_START_SEQ_MODE_MSK |
                                  CY_CAPSENSE_CSD_SEQ_START_START_MSK    |
                                  CY_CAPSENSE_BIST_FSM_AZ0_SKIP          |
                                  CY_CAPSENSE_BIST_FSM_AZ1_SKIP;
        /* Init Watchdog Counter to prevent a hang */
        watchdogCounter = Cy_CapSense_WaitForSeqIdle(watchdogSize, context);

        if (0u == watchdogCounter)
        {
            /* Set the sequencer to the idle state if the coarse initialization fails */
            ptrCsdHwBase->SEQ_START = CY_CAPSENSE_CSD_SEQ_START_ABORT_MSK;
            result = CY_CAPSENSE_BIST_TIMEOUT_E;
        }
    }

    /* Scanning */
    if (CY_CAPSENSE_BIST_SUCCESS_E == result)
    {
        /* Clear previous interrupts */
        ptrCsdHwBase->INTR = CY_CAPSENSE_CSD_INTR_ALL_MSK;
        (void)ptrCsdHwBase->INTR;

        ptrCsdHwBase->CSDCMP = CY_CAPSENSE_CSD_CSDCMP_CSDCMP_EN_MSK;
        ptrCsdHwBase->SW_RES = context->ptrBistContext->regSwResScan;

        if (CY_CAPSENSE_BIST_HW_ELTD_CAP_SH_E != context->ptrBistContext->hwConfig)
        {
            ptrCsdHwBase->SW_HS_P_SEL = context->ptrBistContext->regSwHsPSelScan;
            ptrCsdHwBase->HSCMP = context->ptrBistContext->regHscmpScan;
            ptrCsdHwBase->SW_SHIELD_SEL = context->ptrBistContext->regSwShieldSelScan;
        }
        else
        {
            ptrCsdHwBase->SW_HS_P_SEL = context->ptrBistContext->regSwHsPSelScanShield;
            ptrCsdHwBase->HSCMP = context->ptrBistContext->regHscmpScanShield;
            ptrCsdHwBase->SW_SHIELD_SEL = context->ptrBistContext->regSwShieldSelScanShield;
        }

        ptrCsdHwBase->SEQ_START = CY_CAPSENSE_CSD_SEQ_START_AZ0_SKIP_MSK |
                                  CY_CAPSENSE_CSD_SEQ_START_AZ1_SKIP_MSK |
                                  CY_CAPSENSE_CSD_SEQ_START_START_MSK;
        result = CY_CAPSENSE_BIST_HW_BUSY_E;
    }

    return (result);
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN) ||\
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN)) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureCapacitanceSensorAll
****************************************************************************//**
*
* This internal function measures all the sensors Cp capacitance.
*
* This function measures Cp of all the sensors by using the
* CapSense_GetSensorCapacitance function.
* The function stores the Cp values in the corresponding BIST data
* structure registers.
* The function is called by the Cy_CapSense_RunSelfTest() function.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the measuring process:
* - CY_CAPSENSE_BIST_SUCCESS_E if all the measurements passed successfully.
* - CY_CAPSENSE_BIST_FAIL_E if any measurement was failed.
*
*******************************************************************************/
static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureCapacitanceSensorAll(
                cy_stc_capsense_context_t * context)
{
    uint32_t widgetId;
    uint32_t sensorElement;
    uint32_t numWdgtElectrodes;
    uint32_t snsCap;
    cy_en_capsense_bist_status_t result = CY_CAPSENSE_BIST_SUCCESS_E;

