RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_selftest_v2.c
    /* Loop through all the widgets */
    for (widgetId = 0u; widgetId < context->ptrCommonConfig->numWd; widgetId++)
    {
        /* Get a total number of the widget elements: for CSX, it is numRows + numCols, for CSD, it is totalNumSns */
        if (CY_CAPSENSE_CSX_GROUP == context->ptrWdConfig[widgetId].senseMethod)
        {
            numWdgtElectrodes = context->ptrWdConfig[widgetId].numRows +
                                (uint32_t)context->ptrWdConfig[widgetId].numCols;
        }
        else
        {
            numWdgtElectrodes = context->ptrWdConfig[widgetId].numSns;
        }
        /* Loop through all the sensor electrodes */
        for (sensorElement = 0u; sensorElement < numWdgtElectrodes; sensorElement++)
        {
            if (CY_CAPSENSE_BIST_SUCCESS_E != Cy_CapSense_MeasureCapacitanceSensor(widgetId, sensorElement, &snsCap, context))
            {
                if (CY_CAPSENSE_BIST_SUCCESS_E == result)
                {
                    result = CY_CAPSENSE_BIST_FAIL_E;
                }
            }
        }
    }

    return (result);
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_EXTERNAL_CAP_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_MeasureCapacitanceCap_V2
****************************************************************************//**
*
* Measures the capacitance in picofarads of the specified CAPSENSE&trade; integration
* (external) capacitor.
*
* The function measures the capacitance of the specified external capacitor
* such as Cmod and returns the result through ptrValue, alternatively
* the measurement result is stored in the corresponding field of the
* \ref cy_stc_capsense_bist_context_t structure (either .cModCap, .cIntACap,
* .cIntBCap, or .cShieldCap).
*
* The maximum measurement capacitance is 25nF. The measurement accuracy is
* up to 15%. The measurement resolution is 10 bit which corresponds to the
* maximum capacitance specified by the maxCapacitance parameter. The bigger
* specified maximum capacitance is, the bigger capacitance value is for
* one measured count.
* It is recommended to specify the maximum capacitance twice bigger as the
* nominal capacitor capacitance. For example, if the nominal Cmod value
* is 2.2nF, the maxCapacitance parameter is set to 4nF-5nF.
*
* The function configures all CAPSENSE&trade; pins to  Strong-drive-low mode that
* allows detecting a short of the measured capacitor to other pins.
*
* To measure all the available capacitors, the Cy_CapSense_RunSelfTest()
* function can be used with the CY_CAPSENSE_BIST_SNS_INTEGRITY_MASK mask. The measured
* results are stored in the corresponding field of the
* \ref cy_stc_capsense_bist_context_t structure.
*
* Measurement can be done only if the CAPSENSE&trade; Middleware is in the IDLE
* state. This function must not be called while the CAPSENSE&trade; Middleware is busy.
* The function is blocking, i.e. waits for the measurement to be completed
* prior to returning to the caller.
*
* \note
* This function is available only for the fourth-generation CAPSENSE&trade;.
*
* \param integrationCapId
* Indexes of external capacitors to measure their capacitance.
* There are macros for each of them, namely:
* * CY_CAPSENSE_BIST_CMOD_ID for the CSD method Cmod capacitor
* * CY_CAPSENSE_BIST_CINTA_ID for the CSX method CintA capacitor
* * CY_CAPSENSE_BIST_CINTB_ID for the CSX method CintB capacitor
* * CY_CAPSENSE_BIST_CSH_ID for the CSD method Csh capacitor
*
* \param ptrValue
* The pointer to the result of the measurement. The result is calculated as
* a specified capacitor capacitance value in picofarads. The user
* declares a variable of the uint32_t type and passes the pointer to this
* variable as the function parameter. If the ptrValue parameter is NULL then
* the capacitance value is not returned through the parameter but stored to the
* corresponding field of the \ref cy_stc_capsense_bist_context_t structure.
*
* \param maxCapacitance
* An expected by the user maximum value of the measured capacitance in
* nanofarads in the range from 1 to 25 nF.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E          - The measurement completes
*                                         successfully, the result is valid.
* - CY_CAPSENSE_BIST_BAD_PARAM_E        - The input parameter is invalid.
*                                         The measurement was not executed.
* - CY_CAPSENSE_BIST_HW_BUSY_E          - The CSD HW block is busy with
*                                         a previous operation. The measurement
*                                         was not executed.
* - CY_CAPSENSE_BIST_LOW_LIMIT_E        - The measurement was performed
*                                         but the scanning result is
*                                         below the minimum possible value.
*                                         The measurement result could be invalid.
*                                         The capacitor might be shorted to
*                                         VDD or a PCB track
*                                         is broken (open capacitor).
* - CY_CAPSENSE_BIST_HIGH_LIMIT_E       - The measurement was performed but
*                                         the scanning result is above the
*                                         maximum possible value.
*                                         The measurement result could be invalid.
*                                         The capacitor might be shorted to GND.
* - CY_CAPSENSE_BIST_ERROR_E            - An unexpected fault occurred during
*                                         the measurement.
*
*******************************************************************************/
cy_en_capsense_bist_status_t Cy_CapSense_MeasureCapacitanceCap_V2(
                cy_en_capsense_bist_external_cap_id_t integrationCapId,
                uint32_t * ptrValue,
                uint32_t maxCapacitance,
                cy_stc_capsense_context_t * context)
{
    uint32_t extCapValue = 0u;
    GPIO_PRT_Type * ptrCapPort = NULL;
    uint32_t capacitorPin = 0u;
    uint16_t * ptrResult = NULL;
    uint32_t idacCode = 0u;
    uint32_t idacIdx = 0u;
    uint32_t idacGain = 0u;
    uint64_t tempIDAC;
    cy_en_capsense_bist_status_t bistStatus = CY_CAPSENSE_BIST_SUCCESS_E;

    if ((NULL == context) || (CY_CAPSENSE_BIST_CAP_MEAS_MAX_CAP < maxCapacitance) || (0u == maxCapacitance))
    {
        bistStatus = CY_CAPSENSE_BIST_BAD_PARAM_E;
    }
    if (CY_CAPSENSE_SUCCESS_E != Cy_CapSense_SwitchSensingMode(CY_CAPSENSE_BIST_GROUP, context))
    {
        bistStatus = CY_CAPSENSE_BIST_HW_BUSY_E;
    }

    if (CY_CAPSENSE_BIST_SUCCESS_E == bistStatus)
    {
        switch (integrationCapId)
        {
            case CY_CAPSENSE_BIST_CMOD_ID_E:
                if (CY_CAPSENSE_ENABLE != context->ptrCommonConfig->csdEn)
                {
                    bistStatus = CY_CAPSENSE_BIST_BAD_PARAM_E;
                }
                ptrCapPort = context->ptrCommonConfig->portCmod;
                capacitorPin = (uint32_t)context->ptrCommonConfig->pinCmod;
                ptrResult = &context->ptrBistContext->cModCap;
                break;
            case CY_CAPSENSE_BIST_CINTA_ID_E:
                if (CY_CAPSENSE_ENABLE != context->ptrCommonConfig->csxEn)
                {
                    bistStatus = CY_CAPSENSE_BIST_BAD_PARAM_E;
                }
                ptrCapPort = context->ptrCommonConfig->portCintA;
                capacitorPin = (uint32_t)context->ptrCommonConfig->pinCintA;
                ptrResult = &context->ptrBistContext->cIntACap;
                break;
            case CY_CAPSENSE_BIST_CINTB_ID_E:
                if (CY_CAPSENSE_ENABLE != context->ptrCommonConfig->csxEn)
                {
                    bistStatus = CY_CAPSENSE_BIST_BAD_PARAM_E;
                }
                ptrCapPort = context->ptrCommonConfig->portCintB;
                capacitorPin = (uint32_t)context->ptrCommonConfig->pinCintB;
                ptrResult = &context->ptrBistContext->cIntBCap;
                break;
            #if((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) && \
                (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_CAP_EN))
            case CY_CAPSENSE_BIST_CSH_ID_E:
                ptrCapPort = context->ptrCommonConfig->portCsh;
                capacitorPin = (uint32_t)context->ptrCommonConfig->pinCsh;
                ptrResult = &context->ptrBistContext->cShieldCap;
                break;
            #endif
            default:
                bistStatus = CY_CAPSENSE_BIST_BAD_PARAM_E;
                break;
        }
    }

    if (CY_CAPSENSE_BIST_SUCCESS_E == bistStatus)
    {
        /* Set the BUSY status */
        context->ptrCommonContext->status = CY_CAPSENSE_BUSY;
        Cy_CapSense_BistSwitchHwConfig(CY_CAPSENSE_BIST_HW_EXTERNAL_CAP_E, context);

        /* Calculate the needed IDAC value */
        tempIDAC = ((((((uint64_t)CY_CAPSENSE_BIST_CAP_MEAS_ACCURACY_FACTOR *
                        (uint64_t)context->ptrBistContext->extCapVrefMv) *
                        (uint64_t)context->ptrCommonConfig->periClkHz) * (uint64_t)maxCapacitance) /
                        (uint64_t)context->ptrBistContext->extCapModClk) /
                        (uint64_t)context->ptrBistContext->extCapSnsClk) /
                        (uint64_t)CY_CAPSENSE_BIST_PROMILLE_FACTOR;
        /* IDAC Gain - LSB */
        tempIDAC = (tempIDAC + (CY_CAPSENSE_BIST_IDAC_MAX - 1u)) / CY_CAPSENSE_BIST_IDAC_MAX;
        /* Search for corresponding IDAC gain */
        while(idacIdx < (CY_CAPSENSE_IDAC_GAIN_NUMBER - 1u))
        {
            if (context->ptrCommonConfig->idacGainTable[idacIdx].gainValue > (uint32_t)tempIDAC)
            {
                break;
            }
            idacIdx++;
        }
        idacGain = context->ptrCommonConfig->idacGainTable[idacIdx].gainValue;
        /* Calculate the  IDAC code */
        idacCode = (uint32_t)((((tempIDAC * CY_CAPSENSE_BIST_IDAC_MAX) + idacGain) - 1u) / idacGain);
        if (CY_CAPSENSE_BIST_IDAC_MAX < idacCode)
        {
            idacCode = CY_CAPSENSE_BIST_IDAC_MAX;
        }
        if (0u == idacCode)
        {
            idacCode = 1u;
        }

        context->ptrBistContext->extCapIdacPa = idacCode * idacGain;
        context->ptrCommonConfig->ptrCsdBase->IDACA = CY_CAPSENSE_BIST_CAP_IDAC_MODE_DEFAULT |
                                                      idacCode |
                                                      context->ptrCommonConfig->idacGainTable[idacIdx].gainReg;

