RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_selftest_v2.c
/*******************************************************************************
* Function Name: Cy_CapSense_BistMeasureVddaRun
****************************************************************************//**
*
* This internal function initiates the analog to digital conversion and
* converts the measurement result to the voltage in millivolts.
*
* The function performs the following tasks:
* * Measures the time to bring Cref1 + Cref2 up from Vssa to Vrefhi.
* * Measures the time to bring Cref1 + Cref2 back up to Vrefhi
*   (after bringing them down for time A/2 cycles with IDACB sinking).
* * Measures the time to bring Cref1 + Cref2 from Vdda to Vrefhi.
* * Converts the results of measurements to millivolts.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status of the test execution:
* - CY_CAPSENSE_BIST_SUCCESS_E - The measurement completes
*                                successfully, the result is valid.
* - CY_CAPSENSE_BIST_ERROR_E - An unexpected fault occurred during
*                              the measurement, you may need to repeat
*                              the measurement.
*
*******************************************************************************/
static cy_en_capsense_bist_status_t Cy_CapSense_BistMeasureVddaRun(
                cy_stc_capsense_context_t * context)
{
    uint32_t vddaValue;
    uint32_t tVssa2Vref = 0u;
    uint32_t tRecover = 0u;
    uint32_t tVdda2Vref = 0u;
    uint32_t watchdogPeriod;
    uint32_t watchdogCounter;
    cy_en_csd_status_t conversionStatus;
    cy_en_capsense_bist_status_t retStatus = CY_CAPSENSE_BIST_SUCCESS_E;
    CSD_Type * ptrCsdHwBase = context->ptrCommonConfig->ptrCsdBase;

    watchdogPeriod = Cy_CapSense_WatchdogCyclesNum(
            CY_CAPSENSE_BIST_VDDA_WDT_TIMEOUT,
            (context->ptrCommonConfig->cpuClkHz / CY_CAPSENSE_CONVERSION_MEGA),
            CY_CAPSENSE_BIST_VDDA_WDT_CYCLES_PER_LOOP);

    /* Set the BUSY status */
    context->ptrCommonContext->status = CY_CAPSENSE_BUSY;

    /*
     * Phase 1:
     * Measures the time to bring Cref1 + Cref2 up from Vssa to Vrefhi
     */
    ptrCsdHwBase->ADC_CTL = (ptrCsdHwBase->ADC_CTL & ~CY_CAPSENSE_CSD_ADC_CTL_ADC_MODE_MSK) |
            ((uint32_t)CY_CAPSENSE_BIST_VDDA_MEASMODE_VREF & CY_CAPSENSE_CSD_ADC_CTL_ADC_MODE_MSK);
    ptrCsdHwBase->SEQ_START = CY_CAPSENSE_BIST_VDDA_SEQ_START_MEASURE;
    watchdogCounter = watchdogPeriod;
    do
    {
        conversionStatus = Cy_CSD_GetConversionStatus(ptrCsdHwBase, context->ptrCommonConfig->ptrCsdContext);
        watchdogCounter--;
    }
    while((CY_CSD_BUSY == conversionStatus) && (0u != watchdogCounter));
    ptrCsdHwBase->INTR = CY_CAPSENSE_CSD_INTR_ALL_MSK;
    (void)ptrCsdHwBase->INTR;
    tVssa2Vref = ptrCsdHwBase->ADC_RES;
    if ((0u != (tVssa2Vref & CY_CAPSENSE_CSD_ADC_RES_ADC_OVERFLOW_MSK)) || (0u == watchdogCounter))
    {
        retStatus = CY_CAPSENSE_BIST_ERROR_E;
    }

    /*
     * Phase 2:
     * Measures the time to bring Cref1 + Cref2 back up to Vrefhi
     * (after bringing them down for time A/2 cycles with IDACB sinking)
     */
    if(CY_CAPSENSE_BIST_SUCCESS_E == retStatus)
    {
        ptrCsdHwBase->ADC_CTL = (ptrCsdHwBase->ADC_CTL & ~CY_CAPSENSE_CSD_ADC_CTL_ADC_MODE_MSK) |
                ((uint32_t)CY_CAPSENSE_BIST_VDDA_MEASMODE_VREFBY2 & CY_CAPSENSE_CSD_ADC_CTL_ADC_MODE_MSK);
        ptrCsdHwBase->SEQ_START = CY_CAPSENSE_BIST_VDDA_SEQ_START_MEASURE;
        watchdogCounter = watchdogPeriod;
        do
        {
            conversionStatus = Cy_CSD_GetConversionStatus(ptrCsdHwBase, context->ptrCommonConfig->ptrCsdContext);
            watchdogCounter--;
        }
        while((CY_CSD_BUSY == conversionStatus) && (0u != watchdogCounter));
        ptrCsdHwBase->INTR = CY_CAPSENSE_CSD_INTR_ALL_MSK;
        (void)ptrCsdHwBase->INTR;
        tRecover = ptrCsdHwBase->ADC_RES;
        if ((0u != (tRecover & CY_CAPSENSE_CSD_ADC_RES_ADC_OVERFLOW_MSK)) || (0u == watchdogCounter))
        {
            retStatus = CY_CAPSENSE_BIST_ERROR_E;
        }
    }

    /*
     * Phase 3:
     * Measures the time to bring Cref1 + Cref2 from Vdda to Vrefhi
     */
    if(CY_CAPSENSE_BIST_SUCCESS_E == retStatus)
    {
        /* Connect VDDA to csdbusb */
        ptrCsdHwBase->SW_SHIELD_SEL = CY_CAPSENSE_CSD_SW_SHIELD_SEL_SW_HCBV_STATIC_CLOSE;
        ptrCsdHwBase->ADC_CTL = (ptrCsdHwBase->ADC_CTL & ~CY_CAPSENSE_CSD_ADC_CTL_ADC_MODE_MSK) |
                ((uint32_t)CY_CAPSENSE_BIST_VDDA_MEASMODE_VIN & CY_CAPSENSE_CSD_ADC_CTL_ADC_MODE_MSK);
        ptrCsdHwBase->SEQ_START = CY_CAPSENSE_BIST_VDDA_SEQ_START_MEASURE;
        watchdogCounter = watchdogPeriod;
        do
        {
            conversionStatus = Cy_CSD_GetConversionStatus(ptrCsdHwBase, context->ptrCommonConfig->ptrCsdContext);
            watchdogCounter--;
        }
        while((CY_CSD_BUSY == conversionStatus) && (0u != watchdogCounter));
        ptrCsdHwBase->INTR = CY_CAPSENSE_CSD_INTR_ALL_MSK;
        (void)ptrCsdHwBase->INTR;
        tVdda2Vref = ptrCsdHwBase->ADC_RES;
        if ((0u != (tVdda2Vref & CY_CAPSENSE_CSD_ADC_RES_ADC_OVERFLOW_MSK)) || (0u == watchdogCounter))
        {
            retStatus = CY_CAPSENSE_BIST_ERROR_E;
        }
    }

    /*
     * Phase 4:
     * Convert the results of measurements to millivolts.
     */
    if(CY_CAPSENSE_BIST_SUCCESS_E == retStatus)
    {
        tVssa2Vref &= CY_CAPSENSE_CSD_ADC_RES_VALUE_MSK;
        tRecover &= CY_CAPSENSE_CSD_ADC_RES_VALUE_MSK;
        tVdda2Vref &= CY_CAPSENSE_CSD_ADC_RES_VALUE_MSK;

        /* Adjust tVdda2Vref based on IDAC sink / source mismatch */
        tVdda2Vref = (((2u * tRecover) * tVdda2Vref) + (tVssa2Vref >> 1u)) / tVssa2Vref;
        /* Calculate VDDA */
        vddaValue = context->ptrBistContext->vddaVrefMv;
        vddaValue += ((vddaValue * tVdda2Vref) + (tVssa2Vref >> 1uL)) / tVssa2Vref;
        /* Check for overflow */
        if (CY_CAPSENSE_BIST_VDDA_MAX_16_BITS < vddaValue)
        {
            vddaValue = CY_CAPSENSE_BIST_VDDA_MAX_16_BITS;
        }
        context->ptrBistContext->vddaVoltage = (uint16_t)vddaValue;
    }

    /* Clear the BUSY flag */
    context->ptrCommonContext->status = CY_CAPSENSE_NOT_BUSY;

    return (retStatus);
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_VDDA_EN) */


