RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_selftest_v2.c
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN) ||\
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN))
                case CY_CAPSENSE_BIST_HW_ELTD_CAP_E:
                {
                    Cy_CapSense_BistMeasureCapacitanceSensorEnable(context);
                    break;
                }

                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                    case CY_CAPSENSE_BIST_HW_ELTD_CAP_SH_E:
                    {
                        Cy_CapSense_BistMeasureCapacitanceSensorShieldEnable(context);
                        break;
                    }
                #endif
            #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SH_CAP_EN) ||\
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_SNS_CAP_EN)) */

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_EXTERNAL_CAP_EN)
                case CY_CAPSENSE_BIST_HW_EXTERNAL_CAP_E:
                {
                    Cy_CapSense_BistMeasureCapacitanceCapEnable(context);
                    break;
                }
            #endif

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_VDDA_EN)
                case CY_CAPSENSE_BIST_HW_VDDA_E:
                {
                    Cy_CapSense_BistMeasureVddaEnable(context);
                    break;
                }
            #endif

            default:
            {
                /* Nothing to do */
                break;
            }
        }
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_BistSwitchAllSnsPinState
****************************************************************************//**
*
* This internal function sets all the port control (PC), data (DR) and HSIOM
* registers of all sensor pins to the desired state.
*
* The function sets the desired state for the pin port control register (PC),
* the output data register (DR) and the HSIOM register for all sensor pins
* (Drive Mode, output state, and HSIOM state).
*
* \param desiredPinState
* Specifies the desired pin state. See the possible states
* in the cy_en_capsense_bist_io_state_t enum description.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_BistSwitchAllSnsPinState(
                cy_en_capsense_bist_io_state_t desiredPinState,
                const cy_stc_capsense_context_t * context)
{
    uint32_t desiredDriveMode = CY_CAPSENSE_DM_GPIO_ANALOG;
    en_hsiom_sel_t desiredHsiom = CY_CAPSENSE_HSIOM_SEL_GPIO;
    uint32_t desiredPinOutput = CY_CAPSENSE_BIST_DR_PIN2GND;

    if (context->ptrBistContext->currentISC != desiredPinState)
    {
        /* Change Drive mode and HSIOM depending on the current inactive sensor connection */
        if (CY_CAPSENSE_BIST_IO_STRONG_E == desiredPinState)
        {
            desiredDriveMode = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
            desiredHsiom = CY_CAPSENSE_HSIOM_SEL_GPIO;
            desiredPinOutput = CY_CAPSENSE_BIST_DR_PIN2GND;
        }
        else if (CY_CAPSENSE_BIST_IO_SENSE_E == desiredPinState)
        {
            desiredDriveMode = CY_CAPSENSE_CSD_SCAN_PIN_DM;
            desiredHsiom = CY_CAPSENSE_HSIOM_SEL_CSD_SENSE;
            desiredPinOutput = CY_CAPSENSE_BIST_DR_PIN2GND;
        }
        else if (CY_CAPSENSE_BIST_IO_SHIELD_E == desiredPinState)
        {
            desiredDriveMode = CY_CAPSENSE_DM_SHIELD;
            desiredHsiom = CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD;
            desiredPinOutput = CY_CAPSENSE_BIST_DR_PIN2GND;
        }
        else if (CY_CAPSENSE_BIST_IO_STRONG_HIGH_E == desiredPinState)
        {
            desiredDriveMode = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
            desiredHsiom = CY_CAPSENSE_HSIOM_SEL_GPIO;
            desiredPinOutput = CY_CAPSENSE_BIST_DR_PIN2VDD;
        }
        else
        {
            /* Do nothing */
        }
        /* Set all sensor electrodes to the desired state.*/
        Cy_CapSense_SetIOsInDesiredState(desiredDriveMode, desiredPinOutput, desiredHsiom, context);
        context->ptrBistContext->currentISC = desiredPinState;
    }
}

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_BistSwitchAllShieldPinState
****************************************************************************//**
*
* This internal function sets all the port control (PC), data (DR) and HSIOM
* registers of all shield pins to the desired state.
*
* The function sets the desired state for the pin port control register (PC),
* the output data register (DR) and the HSIOM register for all shield pins
* (Drive Mode, output state, and HSIOM state).
*
* \param desiredPinState
* Specifies the desired pin state. See the possible states
* in the cy_en_capsense_bist_io_state_t enum description.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
static void Cy_CapSense_BistSwitchAllShieldPinState(
                cy_en_capsense_bist_io_state_t desiredPinState,
                const cy_stc_capsense_context_t * context)
{
    uint32_t desiredDriveMode = CY_CAPSENSE_DM_GPIO_ANALOG;
    en_hsiom_sel_t desiredHsiom = CY_CAPSENSE_HSIOM_SEL_GPIO;
    uint32_t desiredPinOutput = CY_CAPSENSE_BIST_DR_PIN2GND;

    if (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csdEn)
    {
        /* Change Drive mode and HSIOM depending on the current inactive sensor connection */
        if (CY_CAPSENSE_BIST_IO_STRONG_E == desiredPinState)
        {
            desiredDriveMode = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
            desiredHsiom = CY_CAPSENSE_HSIOM_SEL_GPIO;
            desiredPinOutput = CY_CAPSENSE_BIST_DR_PIN2GND;
        }
        else if (CY_CAPSENSE_BIST_IO_SENSE_E == desiredPinState)
        {
            desiredDriveMode = CY_CAPSENSE_CSD_SCAN_PIN_DM;
            desiredHsiom = CY_CAPSENSE_HSIOM_SEL_CSD_SENSE;
            desiredPinOutput = CY_CAPSENSE_BIST_DR_PIN2GND;
        }
        else if (CY_CAPSENSE_BIST_IO_SHIELD_E == desiredPinState)
        {
            desiredDriveMode = CY_CAPSENSE_DM_SHIELD;
            desiredHsiom = CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD;
            desiredPinOutput = CY_CAPSENSE_BIST_DR_PIN2GND;
        }
        else if (CY_CAPSENSE_BIST_IO_STRONG_HIGH_E == desiredPinState)
        {
            desiredDriveMode = CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF;
            desiredHsiom = CY_CAPSENSE_HSIOM_SEL_GPIO;
            desiredPinOutput = CY_CAPSENSE_BIST_DR_PIN2VDD;
        }
        else
        {
            /* Do nothing */
        }
        /* Set all CAPSENSE&trade; pins to the desired state */
        Cy_CapSense_SetShieldPinState(desiredDriveMode, desiredPinOutput, desiredHsiom, context);
    }
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN) */


